// ============================================================================
// 
// 終了時の状態を管理
// 
// ============================================================================

// ----------------------------------------------------------------------------
// シリアライズされるため public class である必要がある
// Yv2Settings に組み込むと、ユーザーによる設定初期化後にクラッシュした際に終了時の状態も初期化のままになってしまうため、Yv2Settings から独立させる
// ----------------------------------------------------------------------------

using Shinta;

using System;
using System.Windows;

using YukkoView2.Models.YukkoView2Models;

namespace YukkoView2.Models.Settings
{
	public class ExitSettings : SerializableSettings
	{
		// ====================================================================
		// コンストラクター
		// ====================================================================

		// --------------------------------------------------------------------
		// メインコンストラクター
		// --------------------------------------------------------------------
		public ExitSettings()
				: base(Yv2Model.Instance.EnvModel.LogWriter)
		{
		}

		// ====================================================================
		// public プロパティー
		// ====================================================================

		// --------------------------------------------------------------------
		// 終了時の状態（一般）
		// --------------------------------------------------------------------

		// 前回起動時のバージョン
		public String PrevLaunchVer { get; set; } = String.Empty;

		// 前回起動時のパス
		public String PrevLaunchPath { get; set; } = String.Empty;

		// ウィンドウ位置
		public Rect DesktopBounds { get; set; }

		// RSS 確認日
		public DateTime RssCheckDate { get; set; }

		// ====================================================================
		// public 関数
		// ====================================================================

		// --------------------------------------------------------------------
		// 保存パス
		// --------------------------------------------------------------------
		public override String SettingsPath()
		{
			return Common.UserAppDataFolderPath() + nameof(ExitSettings) + Common.FILE_EXT_CONFIG;
		}
	}
}
